bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
        <module name="EIC" id="U2254" version="3.0.0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40002800"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA00"/>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="8" function="A" pad="PA24"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PA25"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA27"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="14" function="A" pad="PA30"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="EXTINT" index="15" function="A" pad="PA31"/>
              <signal group="NMI" function="A" pad="PA08"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="4" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_DPRESCALER_REGS" value="2" caption="Number of DPRESCALER pin groups"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="INSTANCE_ID" value="10"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2504" version="1.0.0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x4100E000"/>
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="EXTEVT_NUM" value="0" caption="Number of External Event Generators"/>
              <param name="GCLK_ID_0" value="11" caption="Index of Generic Clock 0"/>
              <param name="GCLK_ID_1" value="12" caption="Index of Generic Clock 1"/>
              <param name="GCLK_ID_2" value="13" caption="Index of Generic Clock 2"/>
              <param name="GCLK_ID_3" value="14" caption="Index of Generic Clock 3"/>
              <param name="GCLK_ID_4" value="15" caption="Index of Generic Clock 4"/>
              <param name="GCLK_ID_5" value="16" caption="Index of Generic Clock 5"/>
              <param name="GCLK_ID_6" value="17" caption="Index of Generic Clock 6"/>
              <param name="GCLK_ID_7" value="18" caption="Index of Generic Clock 7"/>
              <param name="GCLK_ID_8" value="19" caption="Index of Generic Clock 8"/>
              <param name="GCLK_ID_9" value="20" caption="Index of Generic Clock 9"/>
              <param name="GCLK_ID_10" value="21" caption="Index of Generic Clock 10"/>
              <param name="GCLK_ID_11" value="22" caption="Index of Generic Clock 11"/>
              <param name="GENERATORS" value="119" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="67" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="7" caption="Number of bits to select Event User"/>
              <param name="INSTANCE_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="U2257" version="1.1.0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x40002C00"/>
            <parameters>
              <param name="GCLK_ID_MSR" value="5" caption="Index of measure generic clock"/>
              <param name="GCLK_ID_REF" value="6" caption="Index of reference generic clock"/>
              <param name="INSTANCE_ID" value="11"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2122" version="1.2.0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40001C00"/>
            <signals>
              <signal group="IO" index="0" function="M" pad="PA30"/>
              <signal group="IO" index="0" function="M" pad="PA14"/>
              <signal group="IO" index="0" function="M" pad="PB22"/>
              <signal group="IO" index="1" function="M" pad="PA15"/>
              <signal group="IO" index="1" function="M" pad="PB23"/>
              <signal group="IO" index="1" function="M" pad="PA27"/>
              <signal group="IO" index="2" function="M" pad="PA16"/>
              <signal group="IO" index="3" function="M" pad="PA17"/>
              <signal group="IO" index="4" function="M" pad="PA10"/>
              <signal group="IO" index="4" function="M" pad="PB10"/>
              <signal group="IO" index="5" function="M" pad="PA11"/>
              <signal group="IO" index="5" function="M" pad="PB11"/>
            </signals>
            <parameters>
              <param name="GENCTRL0_RESETVALUE" value="106" caption="Default specific reset value for generator 0"/>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_BITS" value="4"/>
              <param name="GEN_NUM" value="12" caption="Number of Generic Clock Generators"/>
              <param name="GEN_NUM_MSB" value="11" caption="Number of Generic Clock Generators - 1"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8" caption="Number of Generic Clock Sources - 1"/>
              <param name="IO_NUM" value="8" caption="Number of Generic Clock I/Os"/>
              <param name="NUM" value="48" caption="Number of Generic Clock Users"/>
              <param name="SOURCE_BITS" value="4"/>
              <param name="SOURCE_NUM" value="9" caption="Number of Generic Clock Sources"/>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
