bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
          <user name="TCC0_MC_5" index="24" module-instance="TCC0"/>
          <user name="TCC1_EV_0" index="25" module-instance="TCC1"/>
          <user name="TCC1_EV_1" index="26" module-instance="TCC1"/>
          <user name="TCC1_MC_0" index="27" module-instance="TCC1"/>
          <user name="TCC1_MC_1" index="28" module-instance="TCC1"/>
          <user name="TCC1_MC_2" index="29" module-instance="TCC1"/>
          <user name="TCC1_MC_3" index="30" module-instance="TCC1"/>
          <user name="TCC2_EV_0" index="31" module-instance="TCC2"/>
          <user name="TCC2_EV_1" index="32" module-instance="TCC2"/>
          <user name="TCC2_MC_0" index="33" module-instance="TCC2"/>
          <user name="TCC2_MC_1" index="34" module-instance="TCC2"/>
          <user name="TCC2_MC_2" index="35" module-instance="TCC2"/>
          <user name="TC0_EVU" index="44" module-instance="TC0"/>
          <user name="TC1_EVU" index="45" module-instance="TC1"/>
          <user name="TC2_EVU" index="46" module-instance="TC2"/>
          <user name="TC3_EVU" index="47" module-instance="TC3"/>
          <user name="PDEC_EVU_0" index="52" module-instance="PDEC"/>
          <user name="PDEC_EVU_1" index="53" module-instance="PDEC"/>
          <user name="PDEC_EVU_2" index="54" module-instance="PDEC"/>
          <user name="ADC0_START" index="55" module-instance="ADC0"/>
          <user name="ADC0_SYNC" index="56" module-instance="ADC0"/>
          <user name="ADC1_START" index="57" module-instance="ADC1"/>
          <user name="ADC1_SYNC" index="58" module-instance="ADC1"/>
          <user name="AC_SOC_0" index="59" module-instance="AC"/>
          <user name="AC_SOC_1" index="60" module-instance="AC"/>
          <user name="DAC_START_0" index="61" module-instance="DAC"/>
          <user name="DAC_START_1" index="62" module-instance="DAC"/>
          <user name="CCL_LUTIN_0" index="63" module-instance="CCL"/>
          <user name="CCL_LUTIN_1" index="64" module-instance="CCL"/>
          <user name="CCL_LUTIN_2" index="65" module-instance="CCL"/>
          <user name="CCL_LUTIN_3" index="66" module-instance="CCL"/>
        </users>
      </events>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x61810306"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2501" version="1.0.0" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x1" rw="W" size="1" initval="0x00" caption="Control B">
          <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
          <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
        </register>
        <register name="EVCTRL" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="COMPEO0" caption="Comparator 0 Event Output Enable" mask="0x1"/>
          <bitfield name="COMPEO1" caption="Comparator 1 Event Output Enable" mask="0x2"/>
          <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
          <bitfield name="COMPEI0" caption="Comparator 0 Event Input Enable" mask="0x100"/>
          <bitfield name="COMPEI1" caption="Comparator 1 Event Input Enable" mask="0x200"/>
          <bitfield name="INVEI0" caption="Comparator 0 Input Event Invert Enable" mask="0x1000"/>
          <bitfield name="INVEI1" caption="Comparator 1 Input Event Invert Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
          <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
          <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
        </register>
        <register name="STATUSA" offset="0x7" rw="R" size="1" initval="0x00" caption="Status A">
          <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
          <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
          <bitfield name="WSTATE0" caption="Window 0 Current State" mask="0x30" values="AC_STATUSA__WSTATE0"/>
        </register>
        <register name="STATUSB" offset="0x8" rw="R" size="1" initval="0x00" caption="Status B">
          <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
          <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x9" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="WINCTRL" offset="0xA" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Window Control">
          <bitfield name="WEN0" caption="Window 0 Mode Enable" mask="0x1"/>
          <bitfield name="WINTSEL0" caption="Window 0 Interrupt Selection" mask="0x6" values="AC_WINCTRL__WINTSEL0"/>
        </register>
        <register name="SCALER" offset="0xC" rw="RW" size="1" count="2" initval="0x00" caption="Scaler n">
          <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
        </register>
