bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
        <register name="NBTP" offset="0x1C" rw="RW" size="4" initval="0x06000A03" caption="Nominal Bit Timing and Prescaler">
          <bitfield name="NTSEG2" caption="Nominal Time segment after sample point" mask="0x7F"/>
          <bitfield name="NTSEG1" caption="Nominal Time segment before sample point" mask="0xFF00"/>
          <bitfield name="NBRP" caption="Nominal Baud Rate Prescaler" mask="0x1FF0000"/>
          <bitfield name="NSJW" caption="Nominal (Re)Synchronization Jump Width" mask="0xFE000000"/>
        </register>
        <register name="TSCC" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Timestamp Counter Configuration">
          <bitfield name="TSS" caption="Timestamp Select" mask="0x3" values="CAN_TSCC__TSS"/>
          <bitfield name="TCP" caption="Timestamp Counter Prescaler" mask="0xF0000"/>
        </register>
        <register name="TSCV" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Timestamp Counter Value">
          <bitfield name="TSC" caption="Timestamp Counter" mask="0xFFFF"/>
        </register>
        <register name="TOCC" offset="0x28" rw="RW" size="4" initval="0xFFFF0000" caption="Timeout Counter Configuration">
          <bitfield name="ETOC" caption="Enable Timeout Counter" mask="0x1"/>
          <bitfield name="TOS" caption="Timeout Select" mask="0x6" values="CAN_TOCC__TOS"/>
          <bitfield name="TOP" caption="Timeout Period" mask="0xFFFF0000"/>
        </register>
        <register name="TOCV" offset="0x2C" rw="RW" size="4" initval="0x0000FFFF" caption="Timeout Counter Value">
          <bitfield name="TOC" caption="Timeout Counter" mask="0xFFFF"/>
        </register>
        <register name="ECR" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Error Counter">
          <bitfield name="TEC" caption="Transmit Error Counter" mask="0xFF"/>
          <bitfield name="REC" caption="Receive Error Counter" mask="0x7F00"/>
          <bitfield name="RP" caption="Receive Error Passive" mask="0x8000"/>
          <bitfield name="CEL" caption="CAN Error Logging" mask="0xFF0000"/>
        </register>
        <register name="PSR" offset="0x44" rw="R" size="4" initval="0x00000707" caption="Protocol Status">
          <bitfield name="LEC" caption="Last Error Code" mask="0x7" values="CAN_PSR__LEC"/>
          <bitfield name="ACT" caption="Activity" mask="0x18" values="CAN_PSR__ACT"/>
          <bitfield name="EP" caption="Error Passive" mask="0x20"/>
          <bitfield name="EW" caption="Warning Status" mask="0x40"/>
          <bitfield name="BO" caption="Bus_Off Status" mask="0x80"/>
          <bitfield name="DLEC" caption="Data Phase Last Error Code" mask="0x700" values="CAN_PSR__DLEC"/>
          <bitfield name="RESI" caption="ESI flag of last received CAN FD Message" mask="0x800"/>
          <bitfield name="RBRS" caption="BRS flag of last received CAN FD Message" mask="0x1000"/>
          <bitfield name="RFDF" caption="Received a CAN FD Message" mask="0x2000"/>
          <bitfield name="PXE" caption="Protocol Exception Event" mask="0x4000"/>
          <bitfield name="TDCV" caption="Transmitter Delay Compensation Value" mask="0x7F0000"/>
        </register>
        <register name="TDCR" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="Extended ID Filter Configuration">
          <bitfield name="TDCF" caption="Transmitter Delay Compensation Filter Length" mask="0x7F"/>
          <bitfield name="TDCO" caption="Transmitter Delay Compensation Offset" mask="0x7F00"/>
        </register>
        <register name="IR" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="Interrupt">
          <bitfield name="RF0N" caption="Rx FIFO 0 New Message" mask="0x1"/>
          <bitfield name="RF0W" caption="Rx FIFO 0 Watermark Reached" mask="0x2"/>
          <bitfield name="RF0F" caption="Rx FIFO 0 Full" mask="0x4"/>
          <bitfield name="RF0L" caption="Rx FIFO 0 Message Lost" mask="0x8"/>
          <bitfield name="RF1N" caption="Rx FIFO 1 New Message" mask="0x10"/>
          <bitfield name="RF1W" caption="Rx FIFO 1 Watermark Reached" mask="0x20"/>
          <bitfield name="RF1F" caption="Rx FIFO 1 FIFO Full" mask="0x40"/>
          <bitfield name="RF1L" caption="Rx FIFO 1 Message Lost" mask="0x80"/>
          <bitfield name="HPM" caption="High Priority Message" mask="0x100"/>
          <bitfield name="TC" caption="Timestamp Completed" mask="0x200"/>
          <bitfield name="TCF" caption="Transmission Cancellation Finished" mask="0x400"/>
          <bitfield name="TFE" caption="Tx FIFO Empty" mask="0x800"/>
          <bitfield name="TEFN" caption="Tx Event FIFO New Entry" mask="0x1000"/>
          <bitfield name="TEFW" caption="Tx Event FIFO Watermark Reached" mask="0x2000"/>
          <bitfield name="TEFF" caption="Tx Event FIFO Full" mask="0x4000"/>
          <bitfield name="TEFL" caption="Tx Event FIFO Element Lost" mask="0x8000"/>
          <bitfield name="TSW" caption="Timestamp Wraparound" mask="0x10000"/>
          <bitfield name="MRAF" caption="Message RAM Access Failure" mask="0x20000"/>
          <bitfield name="TOO" caption="Timeout Occurred" mask="0x40000"/>
          <bitfield name="DRX" caption="Message stored to Dedicated Rx Buffer" mask="0x80000"/>
          <bitfield name="BEC" caption="Bit Error Corrected" mask="0x100000"/>
          <bitfield name="BEU" caption="Bit Error Uncorrected" mask="0x200000"/>
          <bitfield name="ELO" caption="Error Logging Overflow" mask="0x400000"/>
          <bitfield name="EP" caption="Error Passive" mask="0x800000"/>
          <bitfield name="EW" caption="Warning Status" mask="0x1000000"/>
          <bitfield name="BO" caption="Bus_Off Status" mask="0x2000000"/>
          <bitfield name="WDI" caption="Watchdog Interrupt" mask="0x4000000"/>
          <bitfield name="PEA" caption="Protocol Error in Arbitration Phase" mask="0x8000000"/>
          <bitfield name="PED" caption="Protocol Error in Data Phase" mask="0x10000000"/>
          <bitfield name="ARA" caption="Access to Reserved Address" mask="0x20000000"/>
        </register>
        <register name="IE" offset="0x54" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable">
          <bitfield name="RF0NE" caption="Rx FIFO 0 New Message Interrupt Enable" mask="0x1"/>
          <bitfield name="RF0WE" caption="Rx FIFO 0 Watermark Reached Interrupt Enable" mask="0x2"/>
          <bitfield name="RF0FE" caption="Rx FIFO 0 Full Interrupt Enable" mask="0x4"/>
          <bitfield name="RF0LE" caption="Rx FIFO 0 Message Lost Interrupt Enable" mask="0x8"/>
          <bitfield name="RF1NE" caption="Rx FIFO 1 New Message Interrupt Enable" mask="0x10"/>
          <bitfield name="RF1WE" caption="Rx FIFO 1 Watermark Reached Interrupt Enable" mask="0x20"/>
          <bitfield name="RF1FE" caption="Rx FIFO 1 FIFO Full Interrupt Enable" mask="0x40"/>
          <bitfield name="RF1LE" caption="Rx FIFO 1 Message Lost Interrupt Enable" mask="0x80"/>
          <bitfield name="HPME" caption="High Priority Message Interrupt Enable" mask="0x100"/>
          <bitfield name="TCE" caption="Timestamp Completed Interrupt Enable" mask="0x200"/>
          <bitfield name="TCFE" caption="Transmission Cancellation Finished Interrupt Enable" mask="0x400"/>
          <bitfield name="TFEE" caption="Tx FIFO Empty Interrupt Enable" mask="0x800"/>
          <bitfield name="TEFNE" caption="Tx Event FIFO New Entry Interrupt Enable" mask="0x1000"/>
          <bitfield name="TEFWE" caption="Tx Event FIFO Watermark Reached Interrupt Enable" mask="0x2000"/>
          <bitfield name="TEFFE" caption="Tx Event FIFO Full Interrupt Enable" mask="0x4000"/>
          <bitfield name="TEFLE" caption="Tx Event FIFO Element Lost Interrupt Enable" mask="0x8000"/>
          <bitfield name="TSWE" caption="Timestamp Wraparound Interrupt Enable" mask="0x10000"/>
          <bitfield name="MRAFE" caption="Message RAM Access Failure Interrupt Enable" mask="0x20000"/>
          <bitfield name="TOOE" caption="Timeout Occurred Interrupt Enable" mask="0x40000"/>
          <bitfield name="DRXE" caption="Message stored to Dedicated Rx Buffer Interrupt Enable" mask="0x80000"/>
          <bitfield name="BECE" caption="Bit Error Corrected Interrupt Enable" mask="0x100000"/>
          <bitfield name="BEUE" caption="Bit Error Uncorrected Interrupt Enable" mask="0x200000"/>
          <bitfield name="ELOE" caption="Error Logging Overflow Interrupt Enable" mask="0x400000"/>
          <bitfield name="EPE" caption="Error Passive Interrupt Enable" mask="0x800000"/>
          <bitfield name="EWE" caption="Warning Status Interrupt Enable" mask="0x1000000"/>
          <bitfield name="BOE" caption="Bus_Off Status Interrupt Enable" mask="0x2000000"/>
          <bitfield name="WDIE" caption="Watchdog Interrupt Interrupt Enable" mask="0x4000000"/>
          <bitfield name="PEAE" caption="Protocol Error in Arbitration Phase Enable" mask="0x8000000"/>
          <bitfield name="PEDE" caption="Protocol Error in Data Phase Enable" mask="0x10000000"/>
          <bitfield name="ARAE" caption="Access to Reserved Address Enable" mask="0x20000000"/>
        </register>
        <register name="ILS" offset="0x58" rw="RW" size="4" initval="0x00000000" caption="Interrupt Line Select">
          <bitfield name="RF0NL" caption="Rx FIFO 0 New Message Interrupt Line" mask="0x1"/>
          <bitfield name="RF0WL" caption="Rx FIFO 0 Watermark Reached Interrupt Line" mask="0x2"/>
          <bitfield name="RF0FL" caption="Rx FIFO 0 Full Interrupt Line" mask="0x4"/>
          <bitfield name="RF0LL" caption="Rx FIFO 0 Message Lost Interrupt Line" mask="0x8"/>
          <bitfield name="RF1NL" caption="Rx FIFO 1 New Message Interrupt Line" mask="0x10"/>
          <bitfield name="RF1WL" caption="Rx FIFO 1 Watermark Reached Interrupt Line" mask="0x20"/>
          <bitfield name="RF1FL" caption="Rx FIFO 1 FIFO Full Interrupt Line" mask="0x40"/>
          <bitfield name="RF1LL" caption="Rx FIFO 1 Message Lost Interrupt Line" mask="0x80"/>
          <bitfield name="HPML" caption="High Priority Message Interrupt Line" mask="0x100"/>
          <bitfield name="TCL" caption="Timestamp Completed Interrupt Line" mask="0x200"/>
          <bitfield name="TCFL" caption="Transmission Cancellation Finished Interrupt Line" mask="0x400"/>
          <bitfield name="TFEL" caption="Tx FIFO Empty Interrupt Line" mask="0x800"/>
          <bitfield name="TEFNL" caption="Tx Event FIFO New Entry Interrupt Line" mask="0x1000"/>
          <bitfield name="TEFWL" caption="Tx Event FIFO Watermark Reached Interrupt Line" mask="0x2000"/>
          <bitfield name="TEFFL" caption="Tx Event FIFO Full Interrupt Line" mask="0x4000"/>
          <bitfield name="TEFLL" caption="Tx Event FIFO Element Lost Interrupt Line" mask="0x8000"/>
          <bitfield name="TSWL" caption="Timestamp Wraparound Interrupt Line" mask="0x10000"/>
          <bitfield name="MRAFL" caption="Message RAM Access Failure Interrupt Line" mask="0x20000"/>
          <bitfield name="TOOL" caption="Timeout Occurred Interrupt Line" mask="0x40000"/>
          <bitfield name="DRXL" caption="Message stored to Dedicated Rx Buffer Interrupt Line" mask="0x80000"/>
          <bitfield name="BECL" caption="Bit Error Corrected Interrupt Line" mask="0x100000"/>
          <bitfield name="BEUL" caption="Bit Error Uncorrected Interrupt Line" mask="0x200000"/>
          <bitfield name="ELOL" caption="Error Logging Overflow Interrupt Line" mask="0x400000"/>
          <bitfield name="EPL" caption="Error Passive Interrupt Line" mask="0x800000"/>
          <bitfield name="EWL" caption="Warning Status Interrupt Line" mask="0x1000000"/>
          <bitfield name="BOL" caption="Bus_Off Status Interrupt Line" mask="0x2000000"/>
          <bitfield name="WDIL" caption="Watchdog Interrupt Interrupt Line" mask="0x4000000"/>
          <bitfield name="PEAL" caption="Protocol Error in Arbitration Phase Line" mask="0x8000000"/>
          <bitfield name="PEDL" caption="Protocol Error in Data Phase Line" mask="0x10000000"/>
          <bitfield name="ARAL" caption="Access to Reserved Address Line" mask="0x20000000"/>
        </register>
        <register name="ILE" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="Interrupt Line Enable">
          <bitfield name="EINT0" caption="Enable Interrupt Line 0" mask="0x1"/>
          <bitfield name="EINT1" caption="Enable Interrupt Line 1" mask="0x2"/>
        </register>
        <register name="GFC" offset="0x80" rw="RW" size="4" initval="0x00000000" caption="Global Filter Configuration">
          <bitfield name="RRFE" caption="Reject Remote Frames Extended" mask="0x1"/>
          <bitfield name="RRFS" caption="Reject Remote Frames Standard" mask="0x2"/>
          <bitfield name="ANFE" caption="Accept Non-matching Frames Extended" mask="0xC" values="CAN_GFC__ANFE"/>
          <bitfield name="ANFS" caption="Accept Non-matching Frames Standard" mask="0x30" values="CAN_GFC__ANFS"/>
        </register>
        <register name="SIDFC" offset="0x84" rw="RW" size="4" initval="0x00000000" caption="Standard ID Filter Configuration">
          <bitfield name="FLSSA" caption="Filter List Standard Start Address" mask="0xFFFF"/>
          <bitfield name="LSS" caption="List Size Standard" mask="0xFF0000"/>
        </register>
        <register name="XIDFC" offset="0x88" rw="RW" size="4" initval="0x00000000" caption="Extended ID Filter Configuration">
          <bitfield name="FLESA" caption="Filter List Extended Start Address" mask="0xFFFF"/>
          <bitfield name="LSE" caption="List Size Extended" mask="0x7F0000"/>
        </register>
        <register name="XIDAM" offset="0x90" rw="RW" size="4" initval="0x1FFFFFFF" caption="Extended ID AND Mask">
          <bitfield name="EIDM" caption="Extended ID Mask" mask="0x1FFFFFFF"/>
        </register>
        <register name="HPMS" offset="0x94" rw="R" size="4" initval="0x00000000" caption="High Priority Message Status">
          <bitfield name="BIDX" caption="Buffer Index" mask="0x3F"/>
          <bitfield name="MSI" caption="Message Storage Indicator" mask="0xC0" values="CAN_HPMS__MSI"/>
          <bitfield name="FIDX" caption="Filter Index" mask="0x7F00"/>
          <bitfield name="FLST" caption="Filter List" mask="0x8000"/>
        </register>
        <register name="NDAT1" offset="0x98" rw="RW" size="4" initval="0x00000000" caption="New Data 1">
          <bitfield name="ND0" caption="New Data 0" mask="0x1"/>
          <bitfield name="ND1" caption="New Data 1" mask="0x2"/>
          <bitfield name="ND2" caption="New Data 2" mask="0x4"/>
          <bitfield name="ND3" caption="New Data 3" mask="0x8"/>
          <bitfield name="ND4" caption="New Data 4" mask="0x10"/>
          <bitfield name="ND5" caption="New Data 5" mask="0x20"/>
          <bitfield name="ND6" caption="New Data 6" mask="0x40"/>
          <bitfield name="ND7" caption="New Data 7" mask="0x80"/>
          <bitfield name="ND8" caption="New Data 8" mask="0x100"/>
          <bitfield name="ND9" caption="New Data 9" mask="0x200"/>
          <bitfield name="ND10" caption="New Data 10" mask="0x400"/>
          <bitfield name="ND11" caption="New Data 11" mask="0x800"/>
          <bitfield name="ND12" caption="New Data 12" mask="0x1000"/>
          <bitfield name="ND13" caption="New Data 13" mask="0x2000"/>
          <bitfield name="ND14" caption="New Data 14" mask="0x4000"/>
          <bitfield name="ND15" caption="New Data 15" mask="0x8000"/>
          <bitfield name="ND16" caption="New Data 16" mask="0x10000"/>
          <bitfield name="ND17" caption="New Data 17" mask="0x20000"/>
          <bitfield name="ND18" caption="New Data 18" mask="0x40000"/>
          <bitfield name="ND19" caption="New Data 19" mask="0x80000"/>
          <bitfield name="ND20" caption="New Data 20" mask="0x100000"/>
          <bitfield name="ND21" caption="New Data 21" mask="0x200000"/>
          <bitfield name="ND22" caption="New Data 22" mask="0x400000"/>
          <bitfield name="ND23" caption="New Data 23" mask="0x800000"/>
          <bitfield name="ND24" caption="New Data 24" mask="0x1000000"/>
          <bitfield name="ND25" caption="New Data 25" mask="0x2000000"/>
          <bitfield name="ND26" caption="New Data 26" mask="0x4000000"/>
          <bitfield name="ND27" caption="New Data 27" mask="0x8000000"/>
          <bitfield name="ND28" caption="New Data 28" mask="0x10000000"/>
          <bitfield name="ND29" caption="New Data 29" mask="0x20000000"/>
          <bitfield name="ND30" caption="New Data 30" mask="0x40000000"/>
          <bitfield name="ND31" caption="New Data 31" mask="0x80000000"/>
        </register>
        <register name="NDAT2" offset="0x9C" rw="RW" size="4" initval="0x00000000" caption="New Data 2">
          <bitfield name="ND32" caption="New Data 32" mask="0x1"/>
          <bitfield name="ND33" caption="New Data 33" mask="0x2"/>
          <bitfield name="ND34" caption="New Data 34" mask="0x4"/>
          <bitfield name="ND35" caption="New Data 35" mask="0x8"/>
          <bitfield name="ND36" caption="New Data 36" mask="0x10"/>
          <bitfield name="ND37" caption="New Data 37" mask="0x20"/>
          <bitfield name="ND38" caption="New Data 38" mask="0x40"/>
          <bitfield name="ND39" caption="New Data 39" mask="0x80"/>
          <bitfield name="ND40" caption="New Data 40" mask="0x100"/>
          <bitfield name="ND41" caption="New Data 41" mask="0x200"/>
          <bitfield name="ND42" caption="New Data 42" mask="0x400"/>
          <bitfield name="ND43" caption="New Data 43" mask="0x800"/>
          <bitfield name="ND44" caption="New Data 44" mask="0x1000"/>
          <bitfield name="ND45" caption="New Data 45" mask="0x2000"/>
          <bitfield name="ND46" caption="New Data 46" mask="0x4000"/>
          <bitfield name="ND47" caption="New Data 47" mask="0x8000"/>
          <bitfield name="ND48" caption="New Data 48" mask="0x10000"/>
          <bitfield name="ND49" caption="New Data 49" mask="0x20000"/>
          <bitfield name="ND50" caption="New Data 50" mask="0x40000"/>
          <bitfield name="ND51" caption="New Data 51" mask="0x80000"/>
          <bitfield name="ND52" caption="New Data 52" mask="0x100000"/>
          <bitfield name="ND53" caption="New Data 53" mask="0x200000"/>
          <bitfield name="ND54" caption="New Data 54" mask="0x400000"/>
          <bitfield name="ND55" caption="New Data 55" mask="0x800000"/>
          <bitfield name="ND56" caption="New Data 56" mask="0x1000000"/>
          <bitfield name="ND57" caption="New Data 57" mask="0x2000000"/>
          <bitfield name="ND58" caption="New Data 58" mask="0x4000000"/>
          <bitfield name="ND59" caption="New Data 59" mask="0x8000000"/>
          <bitfield name="ND60" caption="New Data 60" mask="0x10000000"/>
          <bitfield name="ND61" caption="New Data 61" mask="0x20000000"/>
          <bitfield name="ND62" caption="New Data 62" mask="0x40000000"/>
          <bitfield name="ND63" caption="New Data 63" mask="0x80000000"/>
        </register>
        <register name="RXF0C" offset="0xA0" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 0 Configuration">
          <bitfield name="F0SA" caption="Rx FIFO 0 Start Address" mask="0xFFFF"/>
          <bitfield name="F0S" caption="Rx FIFO 0 Size" mask="0x7F0000"/>
          <bitfield name="F0WM" caption="Rx FIFO 0 Watermark" mask="0x7F000000"/>
          <bitfield name="F0OM" caption="FIFO 0 Operation Mode" mask="0x80000000"/>
        </register>
        <register name="RXF0S" offset="0xA4" rw="R" size="4" initval="0x00000000" caption="Rx FIFO 0 Status">
          <bitfield name="F0FL" caption="Rx FIFO 0 Fill Level" mask="0x7F"/>
          <bitfield name="F0GI" caption="Rx FIFO 0 Get Index" mask="0x3F00"/>
          <bitfield name="F0PI" caption="Rx FIFO 0 Put Index" mask="0x3F0000"/>
          <bitfield name="F0F" caption="Rx FIFO 0 Full" mask="0x1000000"/>
          <bitfield name="RF0L" caption="Rx FIFO 0 Message Lost" mask="0x2000000"/>
        </register>
        <register name="RXF0A" offset="0xA8" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 0 Acknowledge">
          <bitfield name="F0AI" caption="Rx FIFO 0 Acknowledge Index" mask="0x3F"/>
        </register>
        <register name="RXBC" offset="0xAC" rw="RW" size="4" initval="0x00000000" caption="Rx Buffer Configuration">
          <bitfield name="RBSA" caption="Rx Buffer Start Address" mask="0xFFFF"/>
        </register>
        <register name="RXF1C" offset="0xB0" rw="RW" size="4" initval="0x00000000" caption="Rx FIFO 1 Configuration">
          <bitfield name="F1SA" caption="Rx FIFO 1 Start Address" mask="0xFFFF"/>
          <bitfield name="F1S" caption="Rx FIFO 1 Size" mask="0x7F0000"/>
          <bitfield name="F1WM" caption="Rx FIFO 1 Watermark" mask="0x7F000000"/>
          <bitfield name="F1OM" caption="FIFO 1 Operation Mode" mask="0x80000000"/>
        </register>
        <register name="RXF1S" offset="0xB4" rw="R" size="4" initval="0x00000000" caption="Rx FIFO 1 Status">
          <bitfield name="F1FL" caption="Rx FIFO 1 Fill Level" mask="0x7F"/>
          <bitfield name="F1GI" caption="Rx FIFO 1 Get Index" mask="0x3F00"/>
          <bitfield name="F1PI" caption="Rx FIFO 1 Put Index" mask="0x3F0000"/>
          <bitfield name="F1F" caption="Rx FIFO 1 Full" mask="0x1000000"/>
          <bitfield name="RF1L" caption="Rx FIFO 1 Message Lost" mask="0x2000000"/>
          <bitfield name="DMS" caption="Debug Message Status" mask="0xC0000000" values="CAN_RXF1S__DMS"/>
        </register>
