bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
      <value-group name="ICM_RCFG__BEIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__CDWBN">
        <value name="WRBA" value="0"/>
        <value name="COMP" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__DMIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__ECIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__EOM">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__PROCDLY">
        <value name="SHORT" value="0"/>
        <value name="LONG" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__RHIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__SUIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WCIEN">
        <value name="EN" value="0"/>
        <value name="DIS" value="1"/>
      </value-group>
      <value-group name="ICM_RCFG__WRAP">
        <value name="NO" value="0"/>
        <value name="YES" value="1"/>
      </value-group>
      <value-group name="ICM_UASR__URAT">
        <value name="UNSPEC_STRUCT_MEMBER" caption="Unspecified structure member set to one detected when the descriptor is loaded" value="0x0"/>
        <value name="CFG_MODIFIED" caption="CFG modified during active monitoring" value="0x1"/>
        <value name="DSCR_MODIFIED" caption="DSCR modified during active monitoring" value="0x2"/>
        <value name="HASH_MODIFIED" caption="HASH modified during active monitoring" value="0x3"/>
        <value name="READ_ACCESS" caption="Write-only register read access" value="0x4"/>
      </value-group>
    </module>
    <module name="I2S" id="U2224" version="2.0.0" caption="Inter-IC Sound Interface">
      <register-group name="I2S" caption="Inter-IC Sound Interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="CKEN0" caption="Clock Unit 0 Enable" mask="0x4"/>
          <bitfield name="CKEN1" caption="Clock Unit 1 Enable" mask="0x8"/>
          <bitfield name="TXEN" caption="Tx Serializer Enable" mask="0x10"/>
          <bitfield name="RXEN" caption="Rx Serializer Enable" mask="0x20"/>
        </register>
        <register name="CLKCTRL" offset="0x4" rw="RW" size="4" count="2" initval="0x00000000" caption="Clock Unit n Control">
          <bitfield name="SLOTSIZE" caption="Slot Size" mask="0x3" values="I2S_CLKCTRL__SLOTSIZE"/>
          <bitfield name="NBSLOTS" caption="Number of Slots in Frame" mask="0x1C"/>
          <bitfield name="FSWIDTH" caption="Frame Sync Width" mask="0x60" values="I2S_CLKCTRL__FSWIDTH"/>
          <bitfield name="BITDELAY" caption="Data Delay from Frame Sync" mask="0x80" values="I2S_CLKCTRL__BITDELAY"/>
          <bitfield name="FSSEL" caption="Frame Sync Select" mask="0x100" values="I2S_CLKCTRL__FSSEL"/>
          <bitfield name="FSINV" caption="Frame Sync Invert" mask="0x200"/>
          <bitfield name="FSOUTINV" caption="Frame Sync Output Invert" mask="0x400"/>
          <bitfield name="SCKSEL" caption="Serial Clock Select" mask="0x800" values="I2S_CLKCTRL__SCKSEL"/>
          <bitfield name="SCKOUTINV" caption="Serial Clock Output Invert" mask="0x1000"/>
          <bitfield name="MCKSEL" caption="Master Clock Select" mask="0x2000" values="I2S_CLKCTRL__MCKSEL"/>
          <bitfield name="MCKEN" caption="Master Clock Enable" mask="0x4000"/>
          <bitfield name="MCKOUTINV" caption="Master Clock Output Invert" mask="0x8000"/>
          <bitfield name="MCKDIV" caption="Master Clock Division Factor" mask="0x3F0000"/>
          <bitfield name="MCKOUTDIV" caption="Master Clock Output Division Factor" mask="0x3F000000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="Interrupt Enable Clear">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="Interrupt Enable Set">
          <bitfield name="RXRDY0" caption="Receive Ready 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="RXRDY1" caption="Receive Ready 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="RXOR0" caption="Receive Overrun 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="RXOR1" caption="Receive Overrun 1 Interrupt Enable" mask="0x20"/>
          <bitfield name="TXRDY0" caption="Transmit Ready 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="TXRDY1" caption="Transmit Ready 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TXUR0" caption="Transmit Underrun 0 Interrupt Enable" mask="0x1000"/>
          <bitfield name="TXUR1" caption="Transmit Underrun 1 Interrupt Enable" mask="0x2000"/>
        </register>
