bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
      <value-group name="SDHC_NISIER__CINS">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__CINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__CMDC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__CREM">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__DMAINT">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_NISIER__TRFC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__ACMD">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__ADMA">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__CMDCRC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__CMDEND">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__CMDIDX">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__CMDTEO">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__CURLIM">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__DATCRC">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__DATEND">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_EISIER__DATTEO">
        <value name="MASKED" caption="Masked" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__ACMDCRC">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="CRC Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__ACMDEND">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="End Bit Error Generated" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__ACMDIDX">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="Error" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__ACMDTEO">
        <value name="NO" caption="No error" value="0"/>
        <value name="YES" caption="Timeout" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__ACMD12NE">
        <value name="EXEC" caption="Executed" value="0"/>
        <value name="NOT_EXEC" caption="Not executed" value="1"/>
      </value-group>
      <value-group name="SDHC_ACESR__CMDNI">
        <value name="OK" caption="No error" value="0"/>
        <value name="NOT_ISSUED" caption="Not Issued" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__ASINTEN">
        <value name="DISABLED" caption="Disabled" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__DRVSEL">
        <value name="B" caption="Driver Type B is Selected (Default)" value="0"/>
        <value name="A" caption="Driver Type A is Selected" value="1"/>
        <value name="C" caption="Driver Type C is Selected" value="2"/>
        <value name="D" caption="Driver Type D is Selected" value="3"/>
      </value-group>
      <value-group name="SDHC_HC2R__EXTUN">
        <value name="NO" caption="Not Tuned or Tuning Completed" value="0"/>
        <value name="REQUESTED" caption="Execute Tuning" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__PVALEN">
        <value name="HOST" caption="SDCLK and Driver Strength are controlled by Host Controller" value="0"/>
        <value name="AUTO" caption="Automatic Selection by Preset Value is Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__SLCKSEL">
        <value name="FIXED" caption="Fixed clock is used to sample data" value="0"/>
        <value name="TUNED" caption="Tuned clock is used to sample data" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__UHSMS">
        <value name="SDR12" caption="SDR12" value="0"/>
        <value name="SDR25" caption="SDR25" value="1"/>
        <value name="SDR50" caption="SDR50" value="2"/>
        <value name="SDR104" caption="SDR104" value="3"/>
        <value name="DDR50" caption="DDR50" value="4"/>
      </value-group>
      <value-group name="SDHC_HC2R__VS18EN">
        <value name="S33V" caption="3.3V Signaling" value="0"/>
        <value name="S18V" caption="1.8V Signaling" value="1"/>
      </value-group>
      <value-group name="SDHC_HC2R__HS200EN">
        <value name="SDR12" caption="SDR12" value="0"/>
        <value name="SDR25" caption="SDR25" value="1"/>
        <value name="SDR50" caption="SDR50" value="2"/>
        <value name="SDR104" caption="SDR104" value="3"/>
        <value name="DDR50" caption="DDR50" value="4"/>
      </value-group>
      <value-group name="SDHC_CA0R__ADMA2SUP">
        <value name="NO" caption="ADMA2 not Supported" value="0"/>
        <value name="YES" caption="ADMA2 Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__ASINTSUP">
        <value name="NO" caption="Asynchronous Interrupt not Supported" value="0"/>
        <value name="YES" caption="Asynchronous Interrupt supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__BASECLKF">
        <value name="OTHER" caption="Get information via another method" value="0"/>
      </value-group>
      <value-group name="SDHC_CA0R__ED8SUP">
        <value name="NO" caption="8-bit Bus Width not Supported" value="0"/>
        <value name="YES" caption="8-bit Bus Width Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__HSSUP">
        <value name="NO" caption="High Speed not Supported" value="0"/>
        <value name="YES" caption="High Speed Supported" value="1"/>
      </value-group>
      <value-group name="SDHC_CA0R__MAXBLKL">
        <value name="512" caption="512 bytes" value="0"/>
        <value name="1024" caption="1024 bytes" value="1"/>
        <value name="2048" caption="2048 bytes" value="2"/>
      </value-group>
