bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAME51_DFP/1.1.139/atdf/ATSAME51G18A.atdf
      <value-group name="SERCOM_SPIM_CTRLB__AMODE">
        <value name="MASK" caption="SPI Address mask " value="0x0"/>
        <value name="2_ADDRESSES" caption="Two unique Addressess" value="0x1"/>
        <value name="RANGE" caption="Address Range" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLC__DATA32B">
        <value name="DATA_TRANS_8BIT" caption="Transaction from and to DATA register are 8-bit" value="0x0"/>
        <value name="DATA_TRANS_32BIT" caption="Transaction from and to DATA register are 32-bit" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CMODE">
        <value name="ASYNC" caption="Asynchronous Communication" value="0x0"/>
        <value name="SYNC" caption="Synchronous Communication" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__CPOL">
        <value name="IDLE_LOW" caption="TxD Change:- Rising XCK edge, RxD Sample:- Falling XCK edge" value="0x0"/>
        <value name="IDLE_HIGH" caption="TxD Change:- Falling XCK edge, RxD Sample:- Rising XCK edge" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__DORD">
        <value name="MSB" caption="MSB is transmitted first" value="0x0"/>
        <value name="LSB" caption="LSB is transmitted first" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__FORM">
        <value name="USART_FRAME_NO_PARITY" caption="USART frame" value="0x0"/>
        <value name="USART_FRAME_WITH_PARITY" caption="USART frame with parity" value="0x1"/>
        <value name="USART_FRAME_LIN_MASTER_MODE" caption="LIN Master - Break and sync generation" value="0x2"/>
        <value name="USART_FRAME_AUTO_BAUD_NO_PARITY" caption="Auto-baud - break detection and auto-baud" value="0x4"/>
        <value name="USART_FRAME_AUTO_BAUD_WITH_PARITY" caption="Auto-baud - break detection and auto-baud with parity" value="0x5"/>
        <value name="USART_FRAME_ISO_7816" caption="ISO 7816" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__RXPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used for data reception" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD[1] is used for data reception" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD[2] is used for data reception" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD[3] is used for data reception" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__TXPO">
        <value name="PAD0" caption="SERCOM PAD[0] is used for data transmission" value="0x0"/>
        <value name="PAD3" caption="SERCOM_PAD[0] is used for data transmission" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLA__SAMPR">
        <value name="16X_ARITHMETIC" caption="16x over-sampling using arithmetic baudrate generation" value="0x0"/>
        <value name="16X_FRACTIONAL" caption="16x over-sampling using fractional baudrate generation" value="0x1"/>
        <value name="8X_ARITHMETIC" caption="8x over-sampling using arithmetic baudrate generation" value="0x2"/>
        <value name="8X_FRACTIONAL" caption="8x over-sampling using fractional baudrate generation" value="0x3"/>
        <value name="3X_ARITHMETIC" caption="3x over-sampling using arithmetic baudrate generation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__CHSIZE">
        <value name="8_BIT" caption="8 Bits" value="0x0"/>
        <value name="9_BIT" caption="9 Bits" value="0x1"/>
        <value name="5_BIT" caption="5 Bits" value="0x5"/>
        <value name="6_BIT" caption="6 Bits" value="0x6"/>
        <value name="7_BIT" caption="7 Bits" value="0x7"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__PMODE">
        <value name="EVEN" caption="Even Parity" value="0x0"/>
        <value name="ODD" caption="Odd Parity" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLB__SBMODE">
        <value name="1_BIT" caption="One Stop Bit" value="0x0"/>
        <value name="2_BIT" caption="Two Stop Bits" value="0x1"/>
      </value-group>
      <value-group name="SERCOM_USART_CTRLC__DATA32B">
        <value name="DATA_READ_WRITE_CHSIZE" caption="Data reads and writes according CTRLB.CHSIZE" value="0x0"/>
        <value name="DATA_READ_CHSIZE_WRITE_32BIT" caption="Data reads according CTRLB.CHSIZE and writes according 32-bit extension" value="0x1"/>
        <value name="DATA_READ_32BIT_WRITE_CHSIZE" caption="Data reads according 32-bit extension and writes according CTRLB.CHSIZE" value="0x2"/>
        <value name="DATA_READ_WRITE_32BIT" caption="Data reads and writes according 32-bit extension" value="0x3"/>
      </value-group>
    </module>
    <module name="SUPC" id="U2407" version="1.1.0" caption="Supply Controller">
      <register-group name="SUPC" caption="Supply Controller">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="BOD33RDY" caption="BOD33 Ready" mask="0x1"/>
          <bitfield name="BOD33DET" caption="BOD33 Detection" mask="0x2"/>
          <bitfield name="B33SRDY" caption="BOD33 Synchronization Ready" mask="0x4"/>
          <bitfield name="VREGRDY" caption="Voltage Regulator Ready" mask="0x100"/>
          <bitfield name="VCORERDY" caption="VDDCORE Ready" mask="0x400"/>
        </register>
